Repository: TudorCretu/logic-simulator
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: el

source: InputPortNotConnectedError: Input port
el: ΗθύραεισόδουδενείναισυνδεδεμένηΣφάλμα: Θύρα εισόδου

source: Parsed successfully! Valid definition file!
el: Αναλύθηκε με επιτυχία! Αρχείο έγκυρου ορισμού!

source: Parsed successfully! Valid definition file!
el: Αναλύθηκε με επιτυχία! Αρχείο έγκυρου ορισμού!

source: File {} contains {} error(s):
el: Το αρχείο {} περιέχει {} σφάλματα:

source: File {} contains {} error(s):
el: 29/5000Το αρχείο {} περιέχει {} σφάλματα:

source: SyntaxError: Expected a keyword 'DEVICES'
el: Σφάλμασύνταξης: Αναμενόμενη λέξη-κλειδί 'DEVICES'

source: &New
el: &Νέος

source: &Load
el: &Φορτώνω

source: &Save
el: &Αποθηκεύσετε

source: &Exit
el: &Εξοδος

source: &File
el: &Αρχείο

source: &Undo CTRL+Z
el: Αναίρεση CTRL + Z

source: &Redo CTRL+SHIFT+Z
el: & Επαναφορά CTRL + SHIFT + Z

source: &Edit
el: &Επεξεργασία

source: &Fullscreen
el: &ΠΛΗΡΗΣ ΟΘΟΝΗ

source: &Actual Size
el: Πραγματικό μέγεθος

source: Zoom &In CTRL++
el: Μεγέθυνση & In CTRL ++

source: Zoom &Out CTRL+-
el: Μεγέθυνση & έξοδος CTRL + -

source: &View
el: &Θέα

source: &Run
el: &Τρέξιμο

source: &Continue
el: &Να συνεχίσει

source: &About
el: &Σχετικά με

source: &Help
el: &Βοήθεια

source: &Help Commands
el: & Εντολές βοήθειας

source: &ENGLISH
el: &ΑΓΓΛΙΚΑ

source: &GREEK
el: &ΕΛΛΗΝΙΚΑ

source: Load file
el: Φόρτωση αρχείου

source: Activity log
el: Αρχείο καταγραφής δραστηριότητας

source: HIGH
el: ΥΨΗ

source: LOW
el: ΧΑΜ

source: SET
el: ΣΕΙΡΑ

source: ZAP
el: ΑΦΑΙΡΩ.

source: Run
el: Τρέξιμο.

source: Continue
el: να συνεχίσει.

source: Zoom
el: Ανίπταμαι διαγωνίως

source: <- To Start
el: <- Να ξεκινήσω

source: Reset View
el: Επαναφορά προβολής

source: To End ->
el: Στο τέλος ->

source: Console
el: Κονσόλα

source: Properties
el: ιδιότητες.

source: Change State of Switch
el: Αλλάξτε την κατάσταση του διακόπτη

source: Set or Zap Monitors
el: Ορίστε ή αφαιρέστε τις οθόνες

source: Simulate
el: Προσομοιωτής

source: Pan
el: Κίνηση

source: 2D/3D View
el: Προβολή 2D / 3D.

source: Logic Simulator
el: Λογική Προσομοιωτής

source: Logic Simulator Created by Team 05 2019
el: Λογική Προσομοιωτής Δημιουργήθηκε από την ομάδα05 2019

source: About Logsim
el: Σχετικά με το Logsim

source: Undo
el: Ξεκάνω

source: Redo
el: Ξανακάνω

source: Command
el: Εντολή

source: is invalid. Enter 'h' for help.
el: είναι άκυρο. Εισαγάγετε 'h' για βοήθεια

source: Open another definition file
el: Ανοίξτε ένα άλλο αρχείο ορισμού

source: Current state of the simulation has not been saved!
el: Η τρέχουσα κατάσταση της προσομοίωσης δεν έχει σωθεί!

source: Save changes?
el: Αποθήκευσε τις αλλαγές?

source: Choose where to save the file
el: Επιλέξτε από πού να αποθηκεύσετε το αρχείο

source: Cannot save current data in file
el: Δεν είναι δυνατή η αποθήκευση των τρέχοντων δεδομένων στο αρχείο

source: Help
el: Βοήθεια

source: User commands:
el: Εντολές χρηστών:

source: r N - run the simulation for N cycles
el: r N - τρέξτε τη προσομοίωση για N κύκλους

source: c N - continue the simulation for N cycles
el: r N - τρέχει την προσομοίωση για N κύκλους

source: m X - set a monitor on signal X
el: m X - ορίστε μια οθόνη στο σήμα X

source: z X - zap the monitor on signal X
el: z X - ενεργοποιήστε την οθόνη στο σήμα X

source: h - help (this command)
el: h - βοήθεια (αυτή η εντολή)

source: q - quit the program
el: q - κλείστε το πρόγραμμα

source: Help on Commands
el: Βοήθεια στις εντολές

source: Quit
el: Εγκαταλείπω

source: Invalid Command Error
el: Μη έγκυρο σφάλμα εντολών

source: Invalid Argument Error
el: Μη έγκυρο σφάλμα Argument

source: Monitor Present Error
el: Παρακολούθηση σφάλματος παρουσίας

source: Signal Not Monitored Error
el: Σφάλμα μη παρακολουθούμενου σήματος

source: Monitor On Input Signal Error
el: Παρακολούθηση σφάλματος σήματος εισόδου

source: Device Absent Error
el: Απουσία σφάλματος συσκευής

source: Oscillating Network Error
el: Σφάλμα δικτύου που ταλαντώνεται

source: Cannot Open File Error
el: Δεν είναι δυνατό το άνοιγμα του σφάλματος αρχείου

source: simulation.
el: προσομοίωση.

source: Nothing To Undo
el: Δεν υπάρχει τίποτα να ανακληθεί

source: No command left to redo. This is the last state of the
el: Δεν έχει απομείνει καμία εντολή για επαναφορά. Αυτή είναι η τελευταία κατάσταση του

source: Nothing To Redo
el: Τίποτα για να επαναλάβω

source: Nothing to continue. Run first.
el: Τίποτα δεν θα συνεχιστεί. Εκτελέστε πρώτα.

source: Simulation Not Started
el: Η προσομοίωση δεν ξεκίνησε

source: No network avilable. Load a valid definition file.
el: Δεν υπάρχει διαθέσιμο δίκτυο. Τοποθετήστε ένα έγκυρο αρχείο ορισμού.

source: No network available
el: Δεν υπάρχει διαθέσιμο δίκτυο

source: Please check the activity log or the terminal.
el: Ελέγξτε το αρχείο καταγραφής δραστηριοτήτων ή το τερματικό.

source: Invalid definition file
el: Μη έγκυρο αρχείο ορισμού

source: Unknown Error
el: Αγνωστο σφάλμα

source: Set switch
el: Ορισμός διακόπτη

source: to
el: προς το

source: Set monitor on
el: Ενεργοποιήστε την οθόνη

source: Zap monitor on
el: Ενεργοποιήστε την οθόνη On

source: Run simulation for
el: Εκτελέστε προσομοίωση για

source: cycles
el: κύκλους

source: Continue simulation for
el: Συνέχιση προσομοίωσης για

source: cycles. Total cycles:
el: κύκλους. Συνολικοί κύκλοι:

source: Save file
el: Αποθηκεύσετε το αρχείο

source: Load file
el: Φόρτωση αρχείου
